{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9@\u0000\u0000\u0000\u00e9 \u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-5ce900680006>\u00da\u0006resize\u0001\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "input_dtype": "float32", "output_shape": null, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "name": "lambda_2", "arguments": {}, "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u001c\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0002N\u00e9\u0000\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\u0010rgb_to_grayscale)\u0002r\u0003\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-5ce900680006>\u00da\tgrayscale\u0005\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null]}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "name": "lambda_3", "arguments": {}, "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003\u00fa.Normalize the image to be between -0.5 and 0.5g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-5ce900680006>\u00da\tnormalize\t\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", null, null]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "bias": true, "name": "convolution2d_1", "W_constraint": null, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "output_dim": 128, "W_constraint": null, "input_dim": 14880, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "output_dim": 43, "W_constraint": null, "input_dim": 128, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "output_dim": 1, "W_constraint": null, "input_dim": 43, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_3", "b_constraint": null, "activation": "linear", "activity_regularizer": null}}]}