{"config": [{"config": {"arguments": {}, "input_dtype": "float32", "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0010\u0000\u0000\u0000\u00e9 \u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-73ceeda415d3>\u00da\u0006resize\u0001\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "output_shape_type": "raw", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"arguments": {}, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u001c\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0002N\u00e9\u0000\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\u0010rgb_to_grayscale)\u0002r\u0003\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-73ceeda415d3>\u00da\tgrayscale\u0005\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "output_shape": null, "name": "lambda_2", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"arguments": {}, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003\u00fa.Normalize the image to be between -0.5 and 0.5g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-73ceeda415d3>\u00da\tnormalize\t\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", null, null], "output_shape": null, "name": "lambda_3", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_filter": 32, "nb_col": 3, "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_1", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 128, "input_dim": 3360, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 43, "input_dim": 128, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 1, "input_dim": 43, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}