{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "sparse": false, "name": "input_1"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_1", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 32, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_1", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution2d_2", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_2", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 32, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_2", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "convolution2d_3", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_3", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_3", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_3", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "maxpooling2d_1", "config": {"dim_ordering": "tf", "trainable": false, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [3, 3], "border_mode": "valid"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_4", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_4", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 80, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_4", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "convolution2d_5", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_5", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 192, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "batchnormalization_5", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_5", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "maxpooling2d_2", "config": {"dim_ordering": "tf", "trainable": false, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [3, 3], "border_mode": "valid"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_9", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_9", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "batchnormalization_9", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_9", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_7", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_7", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 48, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "convolution2d_10", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_10", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "batchnormalization_7", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_7", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "batchnormalization_10", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_10", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "averagepooling2d_1", "config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 1], "name": "averagepooling2d_1", "pool_size": [3, 3], "border_mode": "same"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_6", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_6", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "convolution2d_8", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_8", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 5, "activation": "relu", "nb_filter": 64, "nb_col": 5, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "convolution2d_11", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_11", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "name": "convolution2d_12", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_12", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 32, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "batchnormalization_6", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_6", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "batchnormalization_8", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_8", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "batchnormalization_11", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_11", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "batchnormalization_12", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_12", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]], "name": "mixed0", "config": {"mode": "concat", "concat_axis": 3, "output_shape_type": "raw", "output_mask_type": "raw", "name": "mixed0", "arguments": {}, "output_mask": null, "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "convolution2d_16", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_16", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "batchnormalization_16", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_16", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "convolution2d_14", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_14", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 48, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "name": "convolution2d_17", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_17", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "batchnormalization_14", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_14", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "name": "batchnormalization_17", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_17", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "averagepooling2d_2", "config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 1], "name": "averagepooling2d_2", "pool_size": [3, 3], "border_mode": "same"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "convolution2d_13", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_13", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "name": "convolution2d_15", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_15", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 5, "activation": "relu", "nb_filter": 64, "nb_col": 5, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "name": "convolution2d_18", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_18", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_2", 0, 0]]], "name": "convolution2d_19", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_19", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 32, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "batchnormalization_13", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_13", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "batchnormalization_15", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_15", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "batchnormalization_18", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_18", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_19", 0, 0]]], "name": "batchnormalization_19", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_19", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]], "name": "mixed1", "config": {"mode": "concat", "concat_axis": 3, "output_shape_type": "raw", "output_mask_type": "raw", "name": "mixed1", "arguments": {}, "output_mask": null, "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "convolution2d_23", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_23", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_23", 0, 0]]], "name": "batchnormalization_23", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_23", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "convolution2d_21", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_21", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 48, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "convolution2d_24", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_24", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_21", 0, 0]]], "name": "batchnormalization_21", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_21", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_24", 0, 0]]], "name": "batchnormalization_24", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_24", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "averagepooling2d_3", "config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 1], "name": "averagepooling2d_3", "pool_size": [3, 3], "border_mode": "same"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "convolution2d_20", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_20", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "convolution2d_22", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_22", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 5, "activation": "relu", "nb_filter": 64, "nb_col": 5, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "name": "convolution2d_25", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_25", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_3", 0, 0]]], "name": "convolution2d_26", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_26", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 32, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_20", 0, 0]]], "name": "batchnormalization_20", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_20", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_22", 0, 0]]], "name": "batchnormalization_22", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_22", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_25", 0, 0]]], "name": "batchnormalization_25", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_25", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "batchnormalization_26", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_26", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]], "name": "mixed2", "config": {"mode": "concat", "concat_axis": 3, "output_shape_type": "raw", "output_mask_type": "raw", "name": "mixed2", "arguments": {}, "output_mask": null, "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]], "name": "convolution2d_28", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_28", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 64, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_28", 0, 0]]], "name": "batchnormalization_28", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_28", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "name": "convolution2d_29", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_29", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_29", 0, 0]]], "name": "batchnormalization_29", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_29", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]], "name": "convolution2d_27", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_27", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 384, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "convolution2d_30", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_30", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 3, "activation": "relu", "nb_filter": 96, "nb_col": 3, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_27", 0, 0]]], "name": "batchnormalization_27", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_27", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_30", 0, 0]]], "name": "batchnormalization_30", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_30", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0]]], "name": "maxpooling2d_3", "config": {"dim_ordering": "tf", "trainable": false, "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [3, 3], "border_mode": "valid"}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]], "name": "mixed3", "config": {"mode": "concat", "concat_axis": 3, "output_shape_type": "raw", "output_mask_type": "raw", "name": "mixed3", "arguments": {}, "output_mask": null, "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "convolution2d_35", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_35", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 128, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_35", 0, 0]]], "name": "batchnormalization_35", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_35", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_35", 0, 0]]], "name": "convolution2d_36", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_36", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 128, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_36", 0, 0]]], "name": "batchnormalization_36", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_36", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "convolution2d_32", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_32", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 128, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_36", 0, 0]]], "name": "convolution2d_37", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_37", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 128, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "batchnormalization_32", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_32", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_37", 0, 0]]], "name": "batchnormalization_37", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_37", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_32", 0, 0]]], "name": "convolution2d_33", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_33", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 128, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_37", 0, 0]]], "name": "convolution2d_38", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_38", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 128, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_33", 0, 0]]], "name": "batchnormalization_33", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_33", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_38", 0, 0]]], "name": "batchnormalization_38", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_38", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "averagepooling2d_4", "config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 1], "name": "averagepooling2d_4", "pool_size": [3, 3], "border_mode": "same"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "convolution2d_31", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_31", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "name": "convolution2d_34", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_34", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_38", 0, 0]]], "name": "convolution2d_39", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_39", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_4", 0, 0]]], "name": "convolution2d_40", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_40", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_31", 0, 0]]], "name": "batchnormalization_31", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_31", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_34", 0, 0]]], "name": "batchnormalization_34", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_34", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_39", 0, 0]]], "name": "batchnormalization_39", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_39", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_40", 0, 0]]], "name": "batchnormalization_40", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_40", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]], "name": "mixed4", "config": {"mode": "concat", "concat_axis": 3, "output_shape_type": "raw", "output_mask_type": "raw", "name": "mixed4", "arguments": {}, "output_mask": null, "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "convolution2d_45", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_45", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_45", 0, 0]]], "name": "batchnormalization_45", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_45", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_45", 0, 0]]], "name": "convolution2d_46", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_46", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_46", 0, 0]]], "name": "batchnormalization_46", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_46", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "convolution2d_42", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_42", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_46", 0, 0]]], "name": "convolution2d_47", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_47", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_42", 0, 0]]], "name": "batchnormalization_42", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_42", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_47", 0, 0]]], "name": "batchnormalization_47", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_47", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_42", 0, 0]]], "name": "convolution2d_43", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_43", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_47", 0, 0]]], "name": "convolution2d_48", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_48", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_43", 0, 0]]], "name": "batchnormalization_43", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_43", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_48", 0, 0]]], "name": "batchnormalization_48", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_48", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "averagepooling2d_5", "config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 1], "name": "averagepooling2d_5", "pool_size": [3, 3], "border_mode": "same"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "convolution2d_41", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_41", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_43", 0, 0]]], "name": "convolution2d_44", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_44", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_48", 0, 0]]], "name": "convolution2d_49", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_49", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_5", 0, 0]]], "name": "convolution2d_50", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_50", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_41", 0, 0]]], "name": "batchnormalization_41", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_41", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_44", 0, 0]]], "name": "batchnormalization_44", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_44", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_49", 0, 0]]], "name": "batchnormalization_49", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_49", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_50", 0, 0]]], "name": "batchnormalization_50", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_50", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]], "name": "mixed5", "config": {"mode": "concat", "concat_axis": 3, "output_shape_type": "raw", "output_mask_type": "raw", "name": "mixed5", "arguments": {}, "output_mask": null, "output_shape": null, "dot_axes": -1, "mode_type": "raw"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "convolution2d_55", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_55", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_55", 0, 0]]], "name": "batchnormalization_55", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_55", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_55", 0, 0]]], "name": "convolution2d_56", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_56", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_56", 0, 0]]], "name": "batchnormalization_56", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_56", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "convolution2d_52", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_52", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_56", 0, 0]]], "name": "convolution2d_57", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_57", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_52", 0, 0]]], "name": "batchnormalization_52", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_52", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_57", 0, 0]]], "name": "batchnormalization_57", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_57", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_52", 0, 0]]], "name": "convolution2d_53", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_53", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 160, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_57", 0, 0]]], "name": "convolution2d_58", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_58", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 160, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_53", 0, 0]]], "name": "batchnormalization_53", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_53", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_58", 0, 0]]], "name": "batchnormalization_58", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_58", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "averagepooling2d_6", "config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 1], "name": "averagepooling2d_6", "pool_size": [3, 3], "border_mode": "same"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "convolution2d_51", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_51", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_53", 0, 0]]], "name": "convolution2d_54", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_54", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 7, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_58", 0, 0]]], "name": "convolution2d_59", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_59", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 7, "b_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_6", 0, 0]]], "name": "convolution2d_60", "config": {"dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_60", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "trainable": false, "nb_row": 1, "activation": "relu", "nb_filter": 192, "nb_col": 1, "b_regularizer": null, "bias": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_51", 0, 0]]], "name": "batchnormalization_51", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_51", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_54", 0, 0]]], "name": "batchnormalization_54", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_54", "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_59", 0, 0]]], "name": "batchnormalization_59", "config": {"mode": 0, "momentum": 0.99, "trainable": false, "name": "batchnormalization_59", "epsilon": 0.001, 